yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3l88.h
/* USART1 data register */
__IO_REG8    (USART1_DR,   0x5231, __READ_WRITE);
/* USART1 baud rate register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV4  : 1;
  unsigned char USART_DIV5  : 1;
  unsigned char USART_DIV6  : 1;
  unsigned char USART_DIV7  : 1;
  unsigned char USART_DIV8  : 1;
  unsigned char USART_DIV9  : 1;
  unsigned char USART_DIV10 : 1;
  unsigned char USART_DIV11 : 1;
} __BITS_USART1_BRR1;
#endif
__IO_REG8_BIT(USART1_BRR1, 0x5232, __READ_WRITE, __BITS_USART1_BRR1);

/* USART1 baud rate register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV0  : 1;
  unsigned char USART_DIV1  : 1;
  unsigned char USART_DIV2  : 1;
  unsigned char USART_DIV3  : 1;
  unsigned char USART_DIV12 : 1;
  unsigned char USART_DIV13 : 1;
  unsigned char USART_DIV14 : 1;
  unsigned char USART_DIV15 : 1;
} __BITS_USART1_BRR2;
#endif
__IO_REG8_BIT(USART1_BRR2, 0x5233, __READ_WRITE, __BITS_USART1_BRR2);

/* USART1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char USARTD      : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_USART1_CR1;
#endif
__IO_REG8_BIT(USART1_CR1,  0x5234, __READ_WRITE, __BITS_USART1_CR1);

/* USART1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_USART1_CR2;
#endif
__IO_REG8_BIT(USART1_CR2,  0x5235, __READ_WRITE, __BITS_USART1_CR2);

/* USART1 control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBCL        : 1;
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char CLKEN       : 1;
  unsigned char STOP0       : 1;
  unsigned char STOP1       : 1;
} __BITS_USART1_CR3;
#endif
__IO_REG8_BIT(USART1_CR3,  0x5236, __READ_WRITE, __BITS_USART1_CR3);

/* USART1 control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD0        : 1;
  unsigned char ADD1        : 1;
  unsigned char ADD2        : 1;
  unsigned char ADD3        : 1;
} __BITS_USART1_CR4;
#endif
__IO_REG8_BIT(USART1_CR4,  0x5237, __READ_WRITE, __BITS_USART1_CR4);

/* USART1 control register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EIE         : 1;
  unsigned char IREN        : 1;
  unsigned char IRLP        : 1;
  unsigned char HDSEL       : 1;
  unsigned char NACK        : 1;
  unsigned char SCEN        : 1;
  unsigned char DMAR        : 1;
  unsigned char DMAT        : 1;
} __BITS_USART1_CR5;
#endif
__IO_REG8_BIT(USART1_CR5,  0x5238, __READ_WRITE, __BITS_USART1_CR5);

/* USART1 guard time register */
__IO_REG8    (USART1_GTR,  0x5239, __READ_WRITE);
/* USART1 prescaler register */
__IO_REG8    (USART1_PSCR, 0x523A, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      USART1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define USART1_SR_PE             USART1_SR_bit.PE
#define USART1_SR_FE             USART1_SR_bit.FE
#define USART1_SR_NF             USART1_SR_bit.NF
#define USART1_SR_OR             USART1_SR_bit.OR
#define USART1_SR_IDLE           USART1_SR_bit.IDLE
#define USART1_SR_RXNE           USART1_SR_bit.RXNE
#define USART1_SR_TC             USART1_SR_bit.TC
#define USART1_SR_TXE            USART1_SR_bit.TXE

#define USART1_BRR1_USART_DIV4   USART1_BRR1_bit.USART_DIV4
#define USART1_BRR1_USART_DIV5   USART1_BRR1_bit.USART_DIV5
#define USART1_BRR1_USART_DIV6   USART1_BRR1_bit.USART_DIV6
#define USART1_BRR1_USART_DIV7   USART1_BRR1_bit.USART_DIV7
#define USART1_BRR1_USART_DIV8   USART1_BRR1_bit.USART_DIV8
#define USART1_BRR1_USART_DIV9   USART1_BRR1_bit.USART_DIV9
#define USART1_BRR1_USART_DIV10  USART1_BRR1_bit.USART_DIV10
#define USART1_BRR1_USART_DIV11  USART1_BRR1_bit.USART_DIV11

#define USART1_BRR2_USART_DIV0   USART1_BRR2_bit.USART_DIV0
#define USART1_BRR2_USART_DIV1   USART1_BRR2_bit.USART_DIV1
#define USART1_BRR2_USART_DIV2   USART1_BRR2_bit.USART_DIV2
#define USART1_BRR2_USART_DIV3   USART1_BRR2_bit.USART_DIV3
#define USART1_BRR2_USART_DIV12  USART1_BRR2_bit.USART_DIV12
#define USART1_BRR2_USART_DIV13  USART1_BRR2_bit.USART_DIV13
#define USART1_BRR2_USART_DIV14  USART1_BRR2_bit.USART_DIV14
#define USART1_BRR2_USART_DIV15  USART1_BRR2_bit.USART_DIV15

#define USART1_CR1_PIEN          USART1_CR1_bit.PIEN
#define USART1_CR1_PS            USART1_CR1_bit.PS
#define USART1_CR1_PCEN          USART1_CR1_bit.PCEN
#define USART1_CR1_WAKE          USART1_CR1_bit.WAKE
#define USART1_CR1_M             USART1_CR1_bit.M
#define USART1_CR1_USARTD        USART1_CR1_bit.USARTD
#define USART1_CR1_T8            USART1_CR1_bit.T8
#define USART1_CR1_R8            USART1_CR1_bit.R8

#define USART1_CR2_SBK           USART1_CR2_bit.SBK
#define USART1_CR2_RWU           USART1_CR2_bit.RWU
#define USART1_CR2_REN           USART1_CR2_bit.REN
#define USART1_CR2_TEN           USART1_CR2_bit.TEN
#define USART1_CR2_ILIEN         USART1_CR2_bit.ILIEN
#define USART1_CR2_RIEN          USART1_CR2_bit.RIEN
#define USART1_CR2_TCIEN         USART1_CR2_bit.TCIEN
#define USART1_CR2_TIEN          USART1_CR2_bit.TIEN

#define USART1_CR3_LBCL          USART1_CR3_bit.LBCL
#define USART1_CR3_CPHA          USART1_CR3_bit.CPHA
#define USART1_CR3_CPOL          USART1_CR3_bit.CPOL
#define USART1_CR3_CLKEN         USART1_CR3_bit.CLKEN
#define USART1_CR3_STOP0         USART1_CR3_bit.STOP0
#define USART1_CR3_STOP1         USART1_CR3_bit.STOP1

#define USART1_CR4_ADD0          USART1_CR4_bit.ADD0
#define USART1_CR4_ADD1          USART1_CR4_bit.ADD1
#define USART1_CR4_ADD2          USART1_CR4_bit.ADD2
#define USART1_CR4_ADD3          USART1_CR4_bit.ADD3

#define USART1_CR5_EIE           USART1_CR5_bit.EIE
#define USART1_CR5_IREN          USART1_CR5_bit.IREN
#define USART1_CR5_IRLP          USART1_CR5_bit.IRLP
#define USART1_CR5_HDSEL         USART1_CR5_bit.HDSEL
#define USART1_CR5_NACK          USART1_CR5_bit.NACK
#define USART1_CR5_SCEN          USART1_CR5_bit.SCEN
#define USART1_CR5_DMAR          USART1_CR5_bit.DMAR
#define USART1_CR5_DMAT          USART1_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART1_SR_PE        0x01
#define MASK_USART1_SR_FE        0x02
#define MASK_USART1_SR_NF        0x04
#define MASK_USART1_SR_OR        0x08
#define MASK_USART1_SR_IDLE      0x10
#define MASK_USART1_SR_RXNE      0x20
#define MASK_USART1_SR_TC        0x40
#define MASK_USART1_SR_TXE       0x80

#define MASK_USART1_BRR1_USART_DIV4 0x01
#define MASK_USART1_BRR1_USART_DIV5 0x02
#define MASK_USART1_BRR1_USART_DIV6 0x04
#define MASK_USART1_BRR1_USART_DIV7 0x08
#define MASK_USART1_BRR1_USART_DIV8 0x10
#define MASK_USART1_BRR1_USART_DIV9 0x20
#define MASK_USART1_BRR1_USART_DIV10 0x40
#define MASK_USART1_BRR1_USART_DIV11 0x80

