yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3l88.h
#define MASK_SPI2_CR2_SSI        0x01
#define MASK_SPI2_CR2_SSM        0x02
#define MASK_SPI2_CR2_RXONLY     0x04
#define MASK_SPI2_CR2_CRCNEXT    0x10
#define MASK_SPI2_CR2_CRCEN      0x20
#define MASK_SPI2_CR2_BDOE       0x40
#define MASK_SPI2_CR2_BDM        0x80

#define MASK_SPI2_ICR_RXDMAEN    0x01
#define MASK_SPI2_ICR_TXDMAEN    0x02
#define MASK_SPI2_ICR_WKIE       0x10
#define MASK_SPI2_ICR_ERRIE      0x20
#define MASK_SPI2_ICR_RXIE       0x40
#define MASK_SPI2_ICR_TXIE       0x80

#define MASK_SPI2_SR_RXNE        0x01
#define MASK_SPI2_SR_TXE         0x02
#define MASK_SPI2_SR_WKUP        0x08
#define MASK_SPI2_SR_CRCERR      0x10
#define MASK_SPI2_SR_MODF        0x20
#define MASK_SPI2_SR_OVR         0x40
#define MASK_SPI2_SR_BSY         0x80

#define MASK_SPI2_TXCRCR_TXCRC   0x7F


/*-------------------------------------------------------------------------
 *      USART2 register definitions
 *-----------------------------------------------------------------------*/
/* USART2 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char OR          : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_USART2_SR;
#endif
__IO_REG8_BIT(USART2_SR,   0x53E0, __READ, __BITS_USART2_SR);

/* USART2 data register */
__IO_REG8    (USART2_DR,   0x53E1, __READ_WRITE);
/* USART2 baud rate register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV4  : 1;
  unsigned char USART_DIV5  : 1;
  unsigned char USART_DIV6  : 1;
  unsigned char USART_DIV7  : 1;
  unsigned char USART_DIV8  : 1;
  unsigned char USART_DIV9  : 1;
  unsigned char USART_DIV10 : 1;
  unsigned char USART_DIV11 : 1;
} __BITS_USART2_BRR1;
#endif
__IO_REG8_BIT(USART2_BRR1, 0x53E2, __READ_WRITE, __BITS_USART2_BRR1);

/* USART2 baud rate register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV0  : 1;
  unsigned char USART_DIV1  : 1;
  unsigned char USART_DIV2  : 1;
  unsigned char USART_DIV3  : 1;
  unsigned char USART_DIV12 : 1;
  unsigned char USART_DIV13 : 1;
  unsigned char USART_DIV14 : 1;
  unsigned char USART_DIV15 : 1;
} __BITS_USART2_BRR2;
#endif
__IO_REG8_BIT(USART2_BRR2, 0x53E3, __READ_WRITE, __BITS_USART2_BRR2);

/* USART2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char USARTD      : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_USART2_CR1;
#endif
__IO_REG8_BIT(USART2_CR1,  0x53E4, __READ_WRITE, __BITS_USART2_CR1);

/* USART2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_USART2_CR2;
#endif
__IO_REG8_BIT(USART2_CR2,  0x53E5, __READ_WRITE, __BITS_USART2_CR2);

/* USART2 control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBCL        : 1;
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char CLKEN       : 1;
  unsigned char STOP        : 2;
} __BITS_USART2_CR3;
#endif
__IO_REG8_BIT(USART2_CR3,  0x53E6, __READ_WRITE, __BITS_USART2_CR3);

/* USART2 control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
} __BITS_USART2_CR4;
#endif
__IO_REG8_BIT(USART2_CR4,  0x53E7, __READ_WRITE, __BITS_USART2_CR4);

/* USART2 control register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EIE         : 1;
  unsigned char IREN        : 1;
  unsigned char IRLP        : 1;
  unsigned char HDSEL       : 1;
  unsigned char NACK        : 1;
  unsigned char SCEN        : 1;
  unsigned char DMAR        : 1;
  unsigned char DMAT        : 1;
} __BITS_USART2_CR5;
#endif
__IO_REG8_BIT(USART2_CR5,  0x53E8, __READ_WRITE, __BITS_USART2_CR5);

/* USART2 guard time register */
__IO_REG8    (USART2_GTR,  0x53E9, __READ_WRITE);
/* USART2 prescaler register */
__IO_REG8    (USART2_PSCR, 0x53EA, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      USART2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define USART2_SR_PE             USART2_SR_bit.PE
#define USART2_SR_FE             USART2_SR_bit.FE
#define USART2_SR_NF             USART2_SR_bit.NF
#define USART2_SR_OR             USART2_SR_bit.OR
#define USART2_SR_IDLE           USART2_SR_bit.IDLE
#define USART2_SR_RXNE           USART2_SR_bit.RXNE
#define USART2_SR_TC             USART2_SR_bit.TC
#define USART2_SR_TXE            USART2_SR_bit.TXE

#define USART2_BRR1_USART_DIV4   USART2_BRR1_bit.USART_DIV4
#define USART2_BRR1_USART_DIV5   USART2_BRR1_bit.USART_DIV5
#define USART2_BRR1_USART_DIV6   USART2_BRR1_bit.USART_DIV6
#define USART2_BRR1_USART_DIV7   USART2_BRR1_bit.USART_DIV7
#define USART2_BRR1_USART_DIV8   USART2_BRR1_bit.USART_DIV8
#define USART2_BRR1_USART_DIV9   USART2_BRR1_bit.USART_DIV9
#define USART2_BRR1_USART_DIV10  USART2_BRR1_bit.USART_DIV10
#define USART2_BRR1_USART_DIV11  USART2_BRR1_bit.USART_DIV11

#define USART2_BRR2_USART_DIV0   USART2_BRR2_bit.USART_DIV0
#define USART2_BRR2_USART_DIV1   USART2_BRR2_bit.USART_DIV1
#define USART2_BRR2_USART_DIV2   USART2_BRR2_bit.USART_DIV2
#define USART2_BRR2_USART_DIV3   USART2_BRR2_bit.USART_DIV3
#define USART2_BRR2_USART_DIV12  USART2_BRR2_bit.USART_DIV12
#define USART2_BRR2_USART_DIV13  USART2_BRR2_bit.USART_DIV13
#define USART2_BRR2_USART_DIV14  USART2_BRR2_bit.USART_DIV14
#define USART2_BRR2_USART_DIV15  USART2_BRR2_bit.USART_DIV15

#define USART2_CR1_PIEN          USART2_CR1_bit.PIEN
#define USART2_CR1_PS            USART2_CR1_bit.PS
#define USART2_CR1_PCEN          USART2_CR1_bit.PCEN
#define USART2_CR1_WAKE          USART2_CR1_bit.WAKE
#define USART2_CR1_M             USART2_CR1_bit.M
#define USART2_CR1_USARTD        USART2_CR1_bit.USARTD
#define USART2_CR1_T8            USART2_CR1_bit.T8
#define USART2_CR1_R8            USART2_CR1_bit.R8

#define USART2_CR2_SBK           USART2_CR2_bit.SBK
#define USART2_CR2_RWU           USART2_CR2_bit.RWU
#define USART2_CR2_REN           USART2_CR2_bit.REN
#define USART2_CR2_TEN           USART2_CR2_bit.TEN
#define USART2_CR2_ILIEN         USART2_CR2_bit.ILIEN
#define USART2_CR2_RIEN          USART2_CR2_bit.RIEN
#define USART2_CR2_TCIEN         USART2_CR2_bit.TCIEN
#define USART2_CR2_TIEN          USART2_CR2_bit.TIEN

